/**
 * Copyright (c) 2017-present, Liu Jinyong
 * All rights reserved.
 *
 * https://github.com/huanxsd/MeiTuan  
 * @flow
 */

// System


export default {
    privacy_aggement_message: `                                 未来世界隐私政策
  更新日期：2021年7月14日
  生效日期：2021年7月14日
  未来世界（简称“我们”）深知个人信息对您的重要性，我们将按照法律法规的规定，保护您的个人信息及隐私安全。
  
  我们制定本“隐私政策”并特别提示：希望您在使用未来世界及相关服务前仔细阅读并理解本隐私政策，以便做出适当的选择。
  
  本隐私政策将帮助您了解：
  1: 我们会遵循隐私政策收集、使用您的信息，但不会仅因您同意本隐私政策而采用强制捆绑的方式一揽子收集个人信息。
  2: 当您使用或开启相关功能或使用服务时，为实现功能、服务所必需，我们会收集、使用相关信息。除非是为实现基本业务功能或根据法律法规要求所必需的必要信息，您均可以拒绝提供且不影响其他功能或服务。我们将在隐私政策中逐项说明哪些是必要信息。
  3: 如果您未登录帐号，我们会通过设备对应的标识符信息来保障信息推送的基本功能。如果您登录了帐号，我们会根据帐号信息实现信息推送。
  4: 精确地理位置、摄像头、麦克风、相册（存储）权限，均不会默认开启，只有经过您的明示授权才会在为实现特定功能或服务时使用，您也可以撤回授权。特别需要指出的是，即使经过您的授权，我们获得了这些敏感权限，也不会在相关功能或服务不需要时而收集您的信息。（
  申请操作系统权限列表 ）
  5
  本隐私政策适用于您通过未来世界应用程序、供第三方网站和应用程序使用的未来世界软件开发工具包（点击查看我们接入授权合作伙伴的SDK详情）和应用程序编程接口（API）方式来访问和使用我们的产品和服务。
  
  下文将帮您详细了解我们如何收集、使用、存储、传输、共享、转让（如适用）与保护个人信息；帮您了解查询、访问、删除、更正、撤回授权个人信息的方式。其中，有关您个人信息权益的条款重要内容我们已用加粗形式提示，请特别关注。
  
  1.我们如何收集和使用您的个人信息
  2.我们会如何使用Cookie和同类技术
  3.我们如何共享、转让、公开披露个人信息
  4.我们如何存储和保护个人信息
  5.管理您的个人信息
  6:权限具体使用信息
  7.未成年人条款
  8.如何管理第三方链接及其服务
  9.隐私政策的通知和修订
  10.联系我们
  1、我们如何收集和使用个人信息
  1.1注册、登录、认证
  1.1.1 注册、登录
  a.
  当您注册、登录未来世界及相关服务时，您可以通过手机号创建帐号，并且您可以完善相关的网络身份识别信息（头像、昵称、密码），收集这些信息是为了帮助您完成注册。您还可以根据自身需求选择填写性别、生日、地区及个人介绍来完善您的信息。
  
  b.
  您也可以使用第三方帐号登录并使用，您将授权我们获取您在第三方平台注册的公开信息（头像、昵称以及您授权的其他信息），用于与未来世界帐号绑定，使您可以直接登录并使用本产品和相关服务。
  
  c.基于我们与通信运营商的合作，当您使用未来世界“一键登录”功能时，经过您的明示同意，运营商会将您的手机号码发送给我们，便于我们为您提供快捷的登录服务。您也可以自主选择手动填写手机号码的方式完成注册或登录。
  
  d.您注册的帐号可以使用或登录未来世界关联方的产品，并获得相关服务或使用相关功能。
  
  1.1.2 认证
  在您使用身份认证的功能或服务时，根据相关法律法规，您可能需要提供您的真实身份信息（真实姓名、身份证号码、电话号码）以完成实名验证。
  这些信息属于个人敏感信息，您可以拒绝提供，但您将可能无法获得相关服务，但不影响其他功能与服务的正常使用。
  
  
  
  
  1.2 资讯浏览
  
  
  
  1.3 发布与互动
  1.3.1 信息发布
  a.您发布内容、评论、提问或回答时，我们将收集您发布的信息，并展示您的昵称、头像、发布内容。
  
  b.您使用上传图片、发布音视频功能时，我们会请求您授权相机、相册（存储空间）、照片、麦克风权限。您如果拒绝授权提供，将无法使用此功能，但不影响您正常使用未来世界的其他功能。
  
  c.您发布信息并选择显示位置时，我们会请求您授权地理位置权限，并收集与本服务相关的位置信息。您如果拒绝授权提供精确地理位置信息，将无法使用此功能，但不影响您正常使用未来世界的其他功能。
  
  d.用户因使用我们的产品或者服务而被我们收集的信息，例如其他用户发布的信息中可能含有您的部分信息（如：在评论、留言、发布图文、音视频中涉及到与您相关的信息）。
  
  1.3.2 互动交流
  您主动关注您感兴趣的帐号、圈子、话题并与之进行互动，进行浏览、评论、收藏、点赞或分享内容时，我们会收集您关注的帐号，并向您展示您关注帐号发布内容。
  
  1.4 运营与安全保障
  1.4.1 运营与安全
  我们致力于为您提供安全、可信的产品与使用环境，提供优质、高效、可靠的服务与信息是我们的核心目标。
  
  
  
  1.5 收集、使用个人信息目的变更
  
  请您了解，随着我们业务的发展，可能会对“未来世界”的功能和提供的服务有所调整变化。
  原则上，当新功能或服务与我们当前提供的功能或服务相关时，收集与使用的个人信息将与原处理目的具有直接或合理关联。
  在与原处理目的无直接或合理关联的场景下，我们收集、使用您的个人信息，会再次进行告知，并征得您的同意。
    
  特别提示您注意，如信息无法单独或结合其他信息识别到您的个人身份，其不属于法律意义上您的个人信息；
  当您的信息可以单独或结合其他信息识别到您的个人身份时或我们将无法与任何特定个人信息建立联系的数据与其他您的个人信息结合使用时，这些信息在结合使用期间，
  将作为您的个人信息按照本隐私政策处理与保护。
  
  
  2、我们如何使用 Cookie 和同类技术
  
  Cookie
  和同类技术是互联网中普遍使用的技术。当您使用未来世界及相关服务时，我们可能会使用相关技术向您的设备发送一个或多个
  Cookie
  或匿名标识符，以收集和存储您访问、使用本产品时的信息。我们承诺，不会将
  Cookie 用于本隐私政策所述目的之外的任何其他用途。我们使用 Cookie
  和同类技术主要为了实现以下功能或服务：
  
  2.1 保障产品与服务的安全、高效运转
  
  我们可能会设置认证与保障安全性的 cookie
  或匿名标识符，使我们确认您是否安全登录服务，或者是否遇到盗用、欺诈及其他不法行为。这些技术还会帮助我们改进服务效率，提升登录和响应速度。
  
  
  2.2 帮助您获得更轻松的访问体验
  
  使用此类技术可以帮助您省去重复您填写个人信息、输入搜索内容的步骤和流程（示例：记录搜索、表单填写）。
  
  
  
  2.3 cookie的清除
  
  大多数浏览器均为用户提供了清除浏览器缓存数据的功能，您可以在浏览器设置功能中进行相应的数据清除操作。如您进行清除，可能因为这些修改，您可能无法使用依赖于Cookie由公司提供的服务或相应功能。
  
  
  3、我们如何共享、转让、公开披露个人信息
  
  3.1共享
  
  3.1.1 共享原则
  
  a.授权同意原则：
  向我们的关联方、第三方共享您的个人信息，需经过您的授权同意，除非共享的个人信息是去标识化处理后的信息，且共享第三方无法重新识别此类信息的自然人主体。如果关联方、第三方使用信息的目的超越原授权同意范围，他们需要重新征得您的同意。
  
  
  b.合法正当与最小必要原则：
  向关联方、第三方共享的数据必须具有合法正当目的，且共享的数据以达成目的必要为限。
  
  
  c.安全审慎原则：
  我们将审慎评估关联方、第三方数据使用共享信息的目的，对这些合作方的安全保障能力进行综合评估，并要求其遵循合作法律协议。
  点击查看我们接入授权合作伙伴的SDK详情。
  
  3.3转让
  
  转让，是指将个人信息控制权由未来世界向另一个个人信息控制者转移的过程。未来世界不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外：
  
  
  1、在获取明确同意的情况下转让：获得您的明确同意后，我们会向其他方转让您的个人信息；
  
  
  2、在涉及合并、收购或破产清算时，如涉及到个人信息转让，我们会在要求新的持有您个人信息的公司、组织继续受本声明的约束，否则我们将要求该公司、组织重新向您征求授权同意。
  
  
  3.4披露
  
  我们仅会在以下情况下，且采取符合业界标准的安全防护措施的前提下，才会披露您的信息：
  
  
  1、根据您的需求，在您明确同意的披露方式下披露您所指定的信息；
  
  
  2、根据法律、法规的要求、强制性的行政执法或司法要求所必须提供您信息的情况下，我们可能会依据所要求的信息类型和披露方式披露您的信息。在符合法律法规的前提下，当我们收到上述披露信息的请求时，我们会要求接收方必须出具与之相应的法律文件，如传票或调查函。我们坚信，对于要求我们提供的信息，应该在法律允许的范围内尽可能保持透明。我们对所有的请求都进行了慎重的审查，以确保其具备合法依据，且仅限于执法部门因特定调查目的且有合法权利获取的数据。
  
  
  4、我们如何存储和保护个人信息
  
  4.1存储地点
  
  我们依照法律法规的规定，将在境内运营过程中收集和产生的您的个人信息存储于中华人民共和国境内。目前，我们不会将上述信息传输至境外，如果我们向境外传输，我们将会遵循相关国家规定或者征求您的同意。
  
  
  4.2存储期限
  
  我们仅在为提供“未来世界”及服务之目的所必需的期间内保留您的个人信息：您发布的信息、评论、点赞及相关信息，在您未撤回、删除或未注销帐号期间，我们会保留相关信息。超出必要期限后，我们将对您的个人信息进行删除或匿名化处理，但法律法规另有规定的除外。
  
  
  4.3保护个人信息的安全
  
  a.我们非常重视您个人信息的安全，将努力采取合理的安全措施（包括技术方面和管理方面）来保护您的个人信息，防止您提供的个人信息被不当使用或未经授权的情况下被访问、公开披露、使用、修改、损坏、丢失或泄漏。
  
  
  b.我们会使用不低于行业同行的加密技术、匿名化处理及相关合理可行的手段保护您的个人信息，并使用安全保护机制防止您的个人信息遭到恶意攻击。
  
  
  c.我们会建立专门的安全部门、安全管理制度、数据安全流程保障您的个人信息安全。我们采取严格的数据使用和访问制度，确保只有授权人员才可访问您的个人信息，并适时对数据和技术进行安全审计。
  
  
  d.尽管已经采取了上述合理有效措施，并已经遵守了相关法律规定要求的标准，但请您理解，由于技术的限制以及可能存在的各种恶意手段，在互联网行业，即便竭尽所能加强安全措施，也不可能始终保证信息百分之百的安全，我们将尽力确保您提供给我们的个人信息的安全性。
  
  
  e.您知悉并理解，您接入我们的服务所用的系统和通讯网络，有可能因我们可控范围外的因素而出现问题。因此，我们强烈建议您采取积极措施保护个人信息的安全，包括但不限于使用复杂密码、定期修改密码、不将自己的帐号密码及相关个人信息透露给他人。
  
  
  f.我们会制定应急处理预案，并在发生用户信息安全事件时立即启动应急预案，努力阻止这些安全事件的影响和后果扩大。一旦发生用户信息安全事件（泄露、丢失）后，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已经采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施。我们将及时将事件相关情况以推送通知、邮件、信函、短信及相关形式告知您，难以逐一告知时，我们会采取合理、有效的方式发布公告。同时，我们还将按照相关监管部门要求，上报用户信息安全事件的处置情况。
  
  
  g.您一旦离开“未来世界”及相关服务，浏览或使用其他网站、服务及内容资源，我们将没有能力和直接义务保护您在未来世界及相关服务之外的软件、网站提交的任何个人信息，无论您登录、浏览或使用上述软件、网站是否基于“未来世界”的链接或引导。
  
  
  5、管理您的个人信息
  
  我们非常重视您对个人信息的管理，并尽全力保护您对于您个人信息的查询、访问、修改、删除、撤回同意授权、注销帐号、投诉举报以及设置隐私功能的相关权利，以使您有能力保障您的隐私和信息安全。
  
  
  5.1访问、删除、更正您的个人信息
  
  a.我们鼓励您更新和修改您的信息以使其更准确有效。您能通过未来世界服务访问您的信息，并根据对应信息的管理方式自行完成或要求我们进行修改、补充和删除。我们将采取适当的技术手段，尽可能保证您可以访问、更新和更正自己的信息或使用未来世界服务时提供的其他信息。
  
  
  b.在访问、更新、更正和删除前述信息时，我们可能会要求您进行身份验证，以保障信息安全。对于通过COOKIES和WEB
  BEACON收集的您的信息，我们还在本《隐私政策》第二条“COOKIES、日志档案和WEB
  BEACON”部分说明了向您提供的选择机制。如您想查询、修改或删除您的部分信息，请登录未来世界产品帐号中心或按照单项服务的具体指引进行操作。
  
  5.2公开与分享
  
  我们的多项服务可让您不仅与您的社交网络、也与使用该服务的所有用户公开分享您的相关信息，例如，您在未来世界服务中所上传或发布的信息、您对其他人上传或发布的信息作出的回应，通过电子邮件或在未来世界服务中不特定用户可见的公开区域内上传或公布您的个人信息，以及包括与这些信息有关的位置数据和日志信息。只要您不删除您所公开或共享的信息，有关信息可能一直留存在公众领域；即使您删除共享信息，有关信息仍可能由其他用户或不受我们控制的第三方独立地缓存、复制或储存，或由其他用户或该等第三方在公众领域保存。如您将信息通过上述渠道公开或共享，由此造成您的信息泄露，我们不承担责任。因此，我们提醒并请您慎重考虑是否通过上述渠道公开或共享您的信息。
  
  5.3改变或撤回授权范围
  
  5.3.1改变或撤回敏感权限设置
  
  a.您可以在设备本身操作系统中关闭GPS地理位置、摄像头、麦克风、相册权限改变同意范围或撤回您的授权。撤回授权后我们将不再收集与这些权限相关信息。
  
  
  b.
  当您使用小游戏、小程序后，您可以在小游戏、小程序界面中管理小程序、小游戏获得的应用权限，您可以撤回对小程序、小游戏的应用权限授权。
  
  
  5.3.2改变或撤回授权范围
  
  特定的业务功能和服务将需要您的信息才能得以完成，当您撤回同意或授权后，我们无法继续为您提供撤回同意或授权所对应的功能和服务，也不再处理您相应的个人信息。但您撤回同意或授权的决定，不会影响公司此前基于您的授权而开展的个人信息处理。
  
  
  5.4有关敏感信息的提示
  
  a.某些信息因其特殊性可能被认为是敏感信息，例如您的种族、宗教、个人健康和医疗信息等，以及身份证明文件、个人生物识别信息、财产信息、行踪轨迹、未成年人的信息等。
  
  
  b.请注意，您在未来世界服务中所提供、上传或发布的内容和信息（例如有关您社交活动的照片或信息），可能会泄露您的敏感信息。您需要谨慎地考虑，是否使用未来世界服务披露您的敏感信息。
  
  
  您同意您的敏感信息按本《隐私政策》所述的目的和方式来处理。
  
  5.5注销
  
  您可以在未来世界“帐号与安全”中申请注销帐号。在您注销帐号前，我们将验证您的个人身份、安全状态、设备信息等。有关注销的流程和内容，请参见《注销协议》。您知悉并理解，注销帐号的行为是不可逆的行为，当您注销帐号后，我们将删除有关您的相关信息或进行匿名化处理，但法律法规另有规定的除外。
  
  
  5.6 投诉举报
  
  您可按照我们公示的制度进行投诉或举报。如果您认为您的个人信息权利可能受到侵害，或者发现侵害个人信息权利的线索（例如：认为我们收集您的个人信息违反法律规定或者双方约定），“我的”—“帮助与反馈”，进入用户反馈界面与我们联系。我们核查后会及时反馈您的投诉与举报。
  
  
  
  5.7 停止运营向您告知
  
  如我们停止运营，我们将及时停止收集您个人信息的活动，将停止运营的通知以逐一送达或公告的形式通知您，并对所持有的您的个人信息进行删除或匿名化处理。

  6、权限具体使用信息  (标明具体使用场景)

  android.permission.CAMERA：拍照权限获取:  (用户上传身份证信息，进行实名认证)
  android.permission.READ_EXTERNAL_STORAGE: 外部储存卡读取:  (读取用户的头像信息缓存信息)
  android.permission.WRITE_EXTERNAL_STORAGE: 外部储存卡写入: (用户的头像信息缓存到本地)
  android.permission.MODIFY_AUDIO_SETTINGS:  在其他应用之上显示内容 (微信登录)
  android.permission.SYSTEM_ALERT_WINDOW:    在其他应用之上显示内容 (微信登录)
  
  7、未成年人条款
  
  a.若您是未满18周岁的未成年人，在使用“未来世界”及相关服务前，应在您的父母或其他监护人监护、指导下共同阅读并同意本隐私政策。
  
  b.我们根据国家相关法律法规的规定保护未成年人的个人信息，只会在法律允许、父母或其他监护人明确同意或保护未成年人所必要的情况下收集、使用、储存、共享、转让或披露未成年人的个人信息；如果我们发现在未事先获得可证实的父母同意的情况下收集了未成年人的个人信息，则会设法尽快删除相关信息。
  
  c.若您是未成年人的监护人，当您对您所监护的未成年人的个人信息有相关疑问时，请通过公司本隐私政策公示的联系方式与我们联系。
  
  8、如何管理第三方链接及其服务
  
  a.“未来世界”可能含有第三方网站、产品与服务的链接。“未来世界”的产品和服务也可能使用或提供来自第三方的产品或服务。
  b.所有含有第三方网站、产品与服务的链接仅为方便用户而提供。未来世界对此类第三方无控制权，无法对链接内容提供任何明示和暗示的保证，此类链接也不视为未来世界对链接内容的推荐或授权；未来世界亦无法控制第三方的隐私或数据保护政策，此类第三方也不受到本声明的约束。
  
  c.您需自行独立判断您与此类链接的互动行为，在向第三方提交个人信息之前，请阅读并参考这些第三方的隐私政策，未来世界对此不承担任何责任。
  
  9、隐私政策的通知和修订
  
  a.为了给您提供更好的服务，未来世界及相关服务将不时更新与变化，我们会适时对本隐私政策进行修订，这些修订构成本隐私政策的一部分并具有等同于本隐私政策的效力，未经您明确同意，我们不会削减您依据当前生效的本隐私政策所应享受的权利。
  
  b.本隐私政策更新后，我们会在未来世界发出更新版本，并在更新后的条款生效前通过官方网站（www.weilaishijieapp.com）公告或其他适当的方式提醒您更新的内容，以便您及时了解本隐私政策的最新版本。
  
  10、联系我们
  
  a.未来世界由陕西欣光祥和网络科技有限公司提供，如对本隐私政策内容有任何疑问、意见或建议，您可通过登录“未来世界”客户端内的“帮助与反馈”页面与我们联系，我们核查并验证您的用户身份后会及时反馈您的投诉与举报。
  
  
  `,
  user_aggement_message: `                                            用户协议 
  
  欢迎您使用未来世界软件及相关服务！
  
  在此特别提醒您（用户）在注册成为用户之前，请认真阅读本《用户协议》（以下简称“本协议”），确保您充分理解本协议中各条款，特别是涉及免除或者限制责任的条款、权利许可和信息使用的条款、账户开通及使用规则条款、第三方信息推送声明条款、进入第三方平台及使用声明条款原力、积分获取及使用条款、法律适用和争议解决条款等。其中，免除或者限制责任条款等重要内容将以加粗形式提示您注意，您应重点阅读。如您未满18周岁，请您在法定监护人陪同下仔细阅读并充分理解本协议，并征得法定监护人的同意后下载本软件。请您审慎阅读并选择接受或不接受本协议。
  
  除非您接受本协议所有条款，否则您无权注册、登录或使用（以下统称“使用”）“未来世界”软件或者通过任何方式使用“未来世界”服务，或者获得“未来世界”软件提供的任何服务。若您使用“未来世界”软件及相关服务（以下简称“本服务”），则视为您已充分理解本协议，并承诺作为本协议的一方当事人接受本协议各项条款的约束。“未来世界”软件服务由陕西欣光祥和网络科技有限公司（以下简称“公司”）开发享有所有知识产权并发布。本协议约定公司与用户之间关于“未来世界”软件服务（以下简称“服务”）的权利义务。
  
  一、定义 
  
  1. 用户：指所有直接或间接获取和使用“未来世界”软件及相关服务的自然人、法人和其他组织等。在本协议中称为“用户”或称“您”。
  
  2. 未来世界：指由公司合法拥有并运营的、标注名称为“未来世界”的客户端应用程序，公司主要向用户提供免费休闲游戏及信息推送服务。
  
  3. 本协议内容同时包括公司已经发布及后续可能不断发布的关于“未来世界”软件及相关服务的相关协议、规则等内容。前述内容一经正式发布，并以适当的方式送达用户（站内信、系统通知等），即为本协议不可分割的组成部分，您应同样遵守。若用户不接受修改后的条款，请立即停止使用服务，用户继续使用服务视为接受修改后的协议。
  
  二、账户开通及使用规则 
  
  账户开通
  
  1.用户在使用本服务前需要注册一个“未来世界”账号。“未来世界”账号应当使用手机号码绑定注册，请用户使用尚未与“未来世界”账号绑定的手机号码、未使用该手机号绑定注册过“未来世界”账户后又注销的、以及未被公司根据本协议封禁的手机号码注册“未来世界”账号。公司可以根据用户需求或产品需要对账号注册和绑定的方式进行变更，而无须事先通知用户。用户设置的账号、密码，是用户登录并以注册用户身份使用本服务的凭证。依照国家互联网信息办公室发布《移动互联网应用程序信息服务管理规定》相关规定，您使用本服务，注册时需要您提供真实有效的身份信息进行验证，来行使对未来世界账户使用和管理。如未进行或未通过实名认证，公司依据法律规定将拒绝为您提供相关服务。您可以按照公司说明申请注销账号，公司会在完成个人身份、安全状态、设备信息等合理和必要的验证后协助您注销账号，并依照您的要求删除有关您账号的一切信息数据，法律法规另有规定的除外。
  
  2.用户在注册“未来世界”账户或者使用“未来世界”提供的服务时，应该具备中华人民共和国法律规定的完全民事行为能力，如用户本身属于不具备完全民事行为能力的未成年人或者属于其他不具备完全民事行为能力的自然人的，用户应该在其监护人的指导下注册“未来世界”账户或者使用本软件所提供的服务，并一并承担由此产生的法律后果。
  
  3.用户可以使用未来世界账户授权登录并绑定“未来世界”账户，用户在使用未来世界账户授权时，应遵守未来世界的授权规则。用户在授权使用未来世界登录“未来世界”时，也授权了“未来世界”可以对获取的用户未来世界信息为以下行为，包括但不限于：
  
  利用用户的未来世界信息设置用户账户头像、呢称等账户基础信息等；
  
  对用户未来世界信息中，不符合国家法律法规、政策规定、风序良俗的内容进行修改、屏蔽、删除等；
  
  使用该获取的未来世界信息进行排名等。
  
  4.您了解并同意，用户须对注册信息的真实性、合法性、有效性承担全部责任；用户不得冒充他人，不得利用他人的名义发布任何信息；不得恶意使用注册帐号导致其他用户误认；否则我们有权立即停止提供服务，您独自承担由此而产生的一切法律责任。公司有权决定是否对您的信息进行核查并核准您的注册申请。如未进行或未通过实名认证，公司依据法律规定将拒绝为您提供相关服务。您可以按照公司说明申请注销账号，公司会在完成个人身份、安全状态、设备信息等合理和必要的验证后协助您注销账号，并依照您的要求删除有关您账号的一切信息，法律法规另有规定的除外。
  
  5.您理解并承诺，您所设置的账号不得违反国家法律法规及公司的相关规则，您的账号名称、头像和简介等注册信息及其他个人信息中不得出现违法和不良信息，未经他人许可不得用他人名义（包括但不限于冒用他人姓名、名称、字号、头像等足以让人引起混淆的方式）开设账号，不得恶意注册“未来世界”账号（包括但不限于频繁注册、批量注册，使用技术手段，平台漏洞恶意注册账号等行为）。您在账号注册及使用过程中需遵守相关法律法规，不得实施任何侵害国家利益、损害其他公民合法权益，有害社会道德风尚的行为。公司有权对您提交的注册信息进行审核。
  
  您在“未来世界”中的注册账号所有权及有关权益均归公司所有，您完成注册手续后仅享有该账号的使用权。您的账号仅限于您本人使用，未经公司书面同意，禁止以任何形式赠与、借用、出租、转让、售卖或以其他方式许可他人使用该账号。如果公司发现或者有合理理由认为使用者并非账号初始注册人，公司有权在未通知您的情况下，暂停或终止向该注册账号提供服务，并有权注销该账号，而无需向注册该账号的用户承担法律责任。
  
  用户注意事项
  1.您理解并同意：为了向您提供有效的服务，本软件会利用您终端设备的处理器和带宽等资源。本软件使用过程中可能产生数据流量的费用，用户需自行向运营商了解相关资费信息，并自行承担相关费用。
  
  4.您理解并同意未来世界将会尽其商业上的合理努力保障您在本软件及服务中的数据存储安全，但是，未来世界并不能就此提供完全保证，包括但不限于以下情形：
  
  5. 未来世界不对您在本软件及服务中相关数据的删除或储存失败负责；
  
  6.未来世界有权根据实际情况自行决定单个用户在本软件及服务中数据的最长储存期限，并在服务器上为其分配数据最大存储空间等。您可根据自己的需要自行备份本软件及服务中的相关数据；
  
  7.如果您停止使用本软件及服务或服务被终止或取消，未来世界可以从服务器上永久地删除您的数据。服务停止、终止或取消后，未来世界没有义务向您返还任何数据。
  
  8.用户在使用本软件及服务时，须自行承担如下来自未来世界不可掌控的风险内容，包括但不限于：
  
  8.1. 由于不可抗拒因素可能引起的个人信息丢失、泄漏等风险；
  
  8.2用户必须选择与所安装终端设备相匹配的软件版本，否则，由于软件与终端设备型号不相匹配所导致的任何问题或损害，均由用户自行承担；
  
  8.3
  用户在使用本软件访问第三方网站时，因第三方网站及相关内容所可能导致的风险，由用户自行承担；
  
  8.4用户发布的内容被他人转发、分享，因此等传播可能带来的风险和责任；
  
  8.5
  由于无线网络信号不稳定、无线网络带宽小等原因，所引起的未来世界账号登录失败、资料同步不完整、页面打开速度慢等风险。
  
  8.6您理解并同意：在使用本服务的过程中，可能会遇到不可抗力等风险因素，使本服务发生中断。不可抗力是指不能预见、不能克服并不能避免且对一方或双方造成重大影响的客观事件，包括但不限于自然灾害如洪水、地震、风暴、瘟疫等以及社会事件如战争、动乱、政府行为等。
  
  账户使用须知
  
  1.用户有责任维护个人账号、密码的安全性与保密性，并对以其注册账号名义所从事的活动承担全部法律责任，包括但不限于用户在“未来世界”上进行的任何数据修改、言论发表等操作行为。您应高度重视对账号与密码的保密，在任何情况下不向他人透露账号及密码。若发现他人未经许可使用您的账号或发生其他任何安全漏洞问题时，应当立即通知公司。
  
  2.您的账号在丢失或遗忘密码后，可遵照公司的申诉途径及时申诉请求找回账号或密码。您理解并认可，公司的密码找回机制仅需要识别申诉单上所填资料与系统记录资料具有一致性，而无法识别申诉人是否系真正账号有权使用者。公司特别提醒您应妥善保管您的账号和密码。当您使用完毕后，应安全退出。因您保管不当可能导致遭受盗号或密码丢失，责任由您自行承担。
  
  3.因您自身原因或其他不可抗因素而导致账号被盗、丢失，均由您本人承担责任，公司不承担任何责任。
  
  4.如用户属于未成年人或者未通过实名认证的，公司将依据国家法律法规和政府政策，对相应的用户账户采取以下措施：
  
  将与您账号相关的信息（包括但不限于您账号的登录信息、使用信息等）提供给您的法定监护人，使得您法定监护人可及时或同步了解您账号情况；
  
  采取技术措施屏蔽某些账号的某些功能；
  
  注销或删除您账号数据等相关信息；
  
  您法定监护人要求采取的，或公司认为可采取的其他合理措施，以限制或禁止您使用“未来世界”；
  
  国家法律法规或政策要求的相关措施。
  
  发布内容规范
  
  1.本条所述内容是指用户使用“未来世界”注册信息及认证资料，或文字、语音、图片、视频、图文等发送、回复或自动回复消息和相关链接页面，以及其他使用账号或本服务所产生的内容。
  
  2.用户在本服务中或通过本服务所传送、发布的任何内容并不反映或代表，也不得被视为反映或代表公司的观点、立场或政策，公司对此不承担任何责任。
  
  3.用户不得利用“未来世界”账号或本服务传播如下法律、法规和政策禁止的内容：
  
  ①反对宪法所确定的基本原则的；
  
  ②危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
  
  ③损害国家荣誉和利益的；
  
  ④煽动民族仇恨、民族歧视，破坏民族团结的；
  
  ⑤破坏国家宗教政策，宣扬邪教和封建迷信的；
  
  ⑥散布谣言，扰乱社会秩序，破坏社会稳定的；
  
  ⑦散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
  
  ⑧侮辱或者诽谤他人，侵害他人合法权益的；
  
  ⑨含有法律、行政法规禁止的其他内容的信息。
  
  4.用户不得利用“未来世界”账号、圈子或本服务传播如下干扰“未来世界”正常运营，或侵犯其他用户或第三方合法权益的内容：
  
  ①含有任何性或暗示性的；
  
  ②含有辱骂、恐吓、威胁内容的；
  
  ③含有骚扰、垃圾广告、恶意信息、诱骗信息的；
  
  ④涉及他人隐私、个人信息或资料的；
  
  ⑤侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利权益的；
  
  ⑥含有其他干扰本服务正常运营和侵权其他用户或第三方合法权益内容的信息。
  
  5.未经公司书面许可，您不得自行或授权、允许、协助任何第三人通过用户注册开通的“未来世界”账户对本协议“未来世界”软件及相关服务中信息内容进行如下行为：
  
  ①复制、读取、采用“未来世界”软件及相关服务的信息内容，用于包括但不限于宣传、增加阅读量、浏览量等商业用途；
  
  ②擅自编辑、整理、编排“未来世界”软件及相关服务的信息内容后在“未来世界”软件及相关服务的源页面以外的渠道进行展示；
  
  ③采用包括但不限于特殊标识、特殊代码等任何形式的识别方法，自行或协助第三人对“未来世界”软件及相关服务的信息内容产生流量、阅读量引导、转移、劫持等不利影响；
  
  ④其他非法获取或使用“未来世界”软件及相关服务的信息内容的行为。
  
  6.用户不得利用账号服务进行如下行为：
  
  ①提交、发布虚假信息，或盗用他人头像或资料，冒充、利用他人名义；
  
  ②强制、诱导其他用户关注、点击链接页面或分享信息；
  
  ③虚构事实、隐瞒真相以误导、欺骗他人；
  
  ④利用技术手段批量建立虚假账号；
  
  ⑤利用“未来世界”账号或本服务从事任何违法犯罪活动；
  
  ⑥制作、发布与以上行为相关的方法、工具，或对此类方法、工具进行运营或传播，无论这些行为是否为商业目的；
  
  ⑦其他违反法律法规规定、侵犯其他用户合法权益、干扰“未来世界”正常运营或公司未明示授权的行为。
  包括但不限于恶意虚构或协助虚构事实、评价等信息或数据向相关部门投诉其它用户或公司情形等。
  
  7.用户不得对公司服务中涉及的链接或推广内容进行域名劫持、恶意跳转、恶意刷量、作弊等，否则，公司有权立即扣除对应部分应获得的收益，因此给公司造成损失的，用户应全额赔偿该损失。
  
  8.如果公司发现或者收到他人举报或投诉用户违反本协议约定的，公司有权不经通知随时对相关内容，包括但不限于用户账号数据、相关资产等记录进行审查、删除，并视情节轻重对违规账号处以包括但不限于警告、账号封禁、设备封禁、功能封禁的处罚，且告知用户处理结果。
  
  9.因违反用户协议被封禁的用户，可以自行与公司联系。封禁用户可提交申诉，公司将对申诉进行审查，并自行合理判断决定是否变更处罚措施。同时，公司有权对被封禁的账号进行公告。
  
  10.用户理解并同意，公司有权依合理判断对违反有关法律法规或本协议的行为进行处罚，对违法违规的任何用户采取适当的法律行动，并依据法律法规保存有关信息向有关部门报告等，用户应承担由此而产生的一切法律责任。
  
  11.关于信息内容的投诉或举报。若您在使用平台过程中，不慎受到合法权益的侵犯，您有权通知我们采取必要措施进行处置。若您在使用平台过程中，发现存在违法违规或违反本服务相关规则的情况，您也有权向我们发起举报，我们亦会及时采取必要措施（删除、屏蔽、断开链接或限制使用功能等）进行处置。但用户应当向我们提供初步证据。如用户未提供初步证据证明且以同一理由多次或恶意向相关部门投诉其它用户或公司干扰本平台正常服务的，公司有权根据情节的严重性对该投诉用户账号进行限制部分功能或直接封号处理。
  
  12.用户使用本服务时不得违反国家法律法规、侵害他人合法权益。但如用户本身被他人投诉侵权或投诉他人侵权的，公司有权将争议中相关方的主体、联系方式、投诉相关内容等必要信息提供给其他争议方或相关部门，以便及时解决投诉纠纷，保护他人合法权益。
  
  13.用户理解并同意，因用户违反本协议约定，导致或产生的任何第三方主张的任何索赔、要求或损失，包括合理的律师费，用户应当赔偿公司及其合作公司、关联公司，并使之免受损害。
  
  未来世界生态圈及第三方产品服务
  
  1.
  您在使用本软件第三方提供的产品或服务时，除遵守本协议约定外，还应遵守第三方的用户协议。未来世界和第三方对可能出现的纠纷在法律规定和约定的范围内各自承担责任。
  
  2.
  因用户使用本软件或要求未来世界提供特定服务时，本软件可能会调用第三方系统或者通过第三方支持用户的使用或访问，使用或访问的结果由该第三方提供（包括但不限于第三方通过微信、支付宝、淘宝提供的服务，或通过开放平台接入的内容等），未来世界不保证通过第三方提供服务及内容的安全性、准确性、有效性及其他不确定的风险，由此若引发的任何争议及损害，与未来世界无关，未来世界不承担任何责任。
  
  4.
  您理解并同意，未来世界有权决定将本软件作商业用途，包括但不限于开发、使用本软件的部分服务为第三方作推广等，未来世界承诺在推广过程中严格按照本协议约定保护您的个人信息，同时您亦可以根据系统设置选择屏蔽、拒绝接收相关推广信息。
  
  3、使用用户个人信息及保护
  
  3.1
  保护用户个人信息是未来世界的一项基本原则，未来世界将会采取合理的措施保护用户的个人信息。除法律法规规定的情形外，未经用户许可未来世界不会向第三方公开、透露用户个人信息。未来世界对相关信息采用专业加密存储与传输方式，保障用户个人信息的安全。
  
  3.2
  您在注册帐号或使用本服务的过程中，需要提供一些必要的信息，例如：为向您提供帐号注册服务或进行用户身份识别，需要您填写手机号码、身份证号码等个人信息；若国家法律法规或政策有特殊规定的，您需要提供真实的身份信息。若您提供的信息不完整，则无法使用本服务或在使用过程中受到限制。
  
  3.3
  一般情况下，您可随时浏览、修改自己提交的信息，但出于安全性和身份识别（如号码申诉服务）的考虑，您可能无法修改注册时提供的初始注册信息及其他验证信息。
  
  3.4
  未来世界将运用各种安全技术和程序建立完善的管理制度来保护您的个人信息，以免遭受未经授权的访问、使用或披露。
  
  3.5
  未经您的同意，未来世界不会向未来世界以外的任何公司、组织和个人披露您的个人信息，但法律法规另有规定的除外。
  
  3.6
  未来世界非常重视对未成年人个人信息的保护。若您是18周岁以下的未成年人，在使用未来世界的服务前，应事先取得您家长或法定监护人的书面同意。
  
  3.7
  对于未来世界会如何收集、使用、存储和保护您的个人信息及您享有何种权利，您还可以阅读《未来世界隐私政策》予以进一步了解。
  
  4、软件的安装与卸载
  
  4.1未来世界可能为不同的终端设备开发了不同的软件版本，您应当根据实际情况选择下载合适的版本进行安装。
  
  4.2 下载安装程序后，您需要按照该程序提示的步骤正确安装。
  
  4.3
  为提供更加优质、安全的服务，在本软件安装时未来世界可能推荐您安装其他软件，您可以选择安装或不安装。
  
  4.4
  如果您不再需要使用本软件或者需要安装新版软件，可以自行卸载。如果您愿意帮助未来世界改进产品服务，请告知卸载的原因。
  
  五、服务政策
  
  公司依托“未来世界”软件向您提供服务，您还应遵守以下约定：
  
  1.您在使用本服务的过程中可能需要下载软件，对于这些软件，公司给予您一项个人的、不可转让及非排他性的许可。您仅可为访问或使用本服务的目的而使用这些软件。
  
  2.您使用“未来世界”软件及相关服务，可以通过预装、公司已授权的第三方下载等方式获取“未来世界”客户端应用程序或访问未来世界官网相关网站。若您并非从公司或经公司授权的第三方获取本软件的，公司无法保证非官方版本的“未来世界”软件能够正常使用，您因此遭受的损失与公司无关。
  
  3.为了改善用户体验、保证服务的安全性及产品功能的一致性，公司可能会对软件进行更新。您应该将相关软件更新到最新版本，否则公司并不保证其能正常使用，您有权选择接受更新版本或服务，如您不接受，部分功能将受到限制或不能继续使用。如您不再需要使用“未来世界”软件及相关服务可自行卸载。
  
  4.除非公司书面许可，您不得从事下列任一行为：
  
  ①删除软件及其副本上关于著作权的信息；
  
  ②对软件进行反向工程、反向汇编、反向编译，或者以其他方式尝试发现软件的源代码；
  
  ③对公司拥有知识产权的内容进行使用、出租、出借、复制、修改、链接、转载、汇编、发表、出版、建立镜像站点等；
  
  ④对软件或者软件运行过程中释放到任何终端内存中的数据、软件运行过程中客户端与服务器端的交互数据，以及软件运行所必需的系统数据，进行复制、修改、增加、删除、挂接运行或创作任何衍生作品，形式包括但不限于使用插件、外挂或非经公司授权的第三方工具/服务接入软件和相关系统；
  
  ⑤通过修改或伪造软件运行中的指令、数据，增加、删减、变动软件的功能或运行效果，或者将用于上述用途的软件、方法进行运营或向公众传播，无论这些行为是否为商业目的；
  
  ⑥通过非公司开发、授权的第三方软件、插件、外挂、系统，登录或使用公司软件及服务，或制作、发布、传播非公司开发、授权的第三方软件、插件、外挂、系统。
  
  五、原力值、积分获取及使用规则
  
  1.“原力，积分”是“未来世界”的计数单位，“原力，积分”可以在公司所运营的未来世界等生态应用软件中使用。
  
  2.用户可以通过使用“未来世界”软件来获得有“未来世界”软件系统奖励的“原力值、积分”，另外参与“未来世界”官方组织的活动也能获得“未来世界”官方所赠送的“原力值，积分”等，具体规则详见具体活动规则，“未来世界”及公司对该活动规则具有最终解释权。
  
  3.
  “原力、积分”除通过前述第2款的方式产生外，任何其它能使用户在“未来世界”中获取“原力、积分”的行为均属于非法获取行为，包括但不限于：通过人民币交易买卖所得、通过入侵计算机系统修改数据所得、通过使用“未来世界”等未来世界生态应用软件外挂软件所得、通过利用
  “未来世界”等未来世界生态应用软件漏洞所得等，公司有权对使用非法获取行为获得“原力、积分”的用户账号采取警告、没收非法所得、临时封禁（具体封禁时间由公司视用户非法获取行为的严重程度而定）、永久封禁等处罚措施。
  
  4.用户应当知悉并了解任何宣传可以以非本条2款模式获取“原力、积分”的途径，均系非官方途径，存在极大的风险，如您的账号因涉及到使用该类非官方途径获取“原力，积分”等而被“未来世界”官方永久封禁或者因此而受到其它人身或者财产损失的，公司或者“未来世界”对此不承担任何责任。
  
  5.通过任何形式交易、转移、购买“未来世界”等未来生态应用软件内的“原力，积分”的行为均为“未来世界”官方所禁止，包括但不限于通过转移账号的形式转移账号内的“原力，积分”等，该类行为一经发现，“未来世界”有权对涉及的相关账户做永久封禁处理。
  
  6.
  “积分”在“未来世界”内，可以通过一定的形式转化用户的收益，公司有权根据经营策略等问题决定或调整每日所有用户平均收益、总额上限等，同时公司也有权根据经营策略等问题对用户账户内的剩余收益进行冻结或清零。
  
  7.请您理解原力值，积分等并非您拥有所有权的财产，且请您在符合相应的兑换和使用规则的情况下使用原力值，积分。在有合理理由怀疑您通过欺诈、滥用等情况不正当行为获得或使用原力值，积分的，或您严重违反相关规则的情况下，您的原力值，积分可能被停发、取消，还可能被限制或终止使用。请您理解，为了保障您的权益和服务的安全性，未来世界需要收集您的信息。未来世界可能会提供其他服务入口。当您使用其他服务时，相关服务方可能需要收集您的信息必要信息，请您关注对应的服务规则。
  
  8.您可以随时关闭、卸载未来世界APP及其生态应用软件，但您关闭或卸载未来世界APP及其生态应用软件连续超过30日（含本数）以及您连续超过30日（含本数）未使用未来世界APP的，您已获得的原力值，积分等将无法使用（到期后自动清除）。因此，我们建议您在关闭、卸载或连续超过30日（含本数）未登陆、未使用未来世界APP及其生态应用软件之前，将您已获得的全部原力值，积分等使用完毕，否则您在关闭或卸载未来世界APP及其生态应用软件连续超过30日（含本数）之前未兑换的积分将全部清零，且您将无法继续获得积分。
  
  9.如用户认为自己的账号属于被“公司”错误封禁或处罚的，可以在该封禁或处罚发生并公告之日起7个工作日内，向公司进行申诉，由公司视后续调查情况进行处理。
  
  六、第三方信息推送声明
  
  1.信息推送服务为“未来世界”的不可或缺重要服务之一。用户应当知悉在使用“未来世界”软件的过程中可能会出现的信息推送，并愿意接受该信息推送服务。
  
  2.“未来世界”所推送的信息，系公司和第三方供应商、合作伙伴提供。公司依法对该信息的内容进行审核，除法律法规明确规定外，公司不承担任何责任。
  
  3.您同意在接受我们提供服务的同时，允许我们在遵守法律法规的前提下自行或由第三方广告商向您发送、展示广告、推广或宣传信息（包括商业与非商业信息）。如您对发送、推荐的广告或信息不感兴趣，您可以基于我们提供的相关技术选项，向我们申请控制系统向您展示或不展示/减少展示相关类型的广告或信息。
  同时我们有权根据您的兴趣提供相关的展示信息
  
  七、进入第三方平台及使用声明
  
  1.“未来世界”软件内设的娱乐版块，其内容系属第三方平台提供，为用户提供休闲游戏、购物向导等服务。
  
  2.是否进入第三方平台进行休闲游戏或者购物的操作，由用户自行决定，“未来世界”仅为用户提供入口链接服务。
  
  3.未来世界的入口链接服务仅仅为记录数据流量，“未来世界”承诺不会将用户的注册信息数据通过该链接入口泄露给第三方平台。
  
  4.用户应当知悉并理解其进入第三方平台后所为的一切操作，包括但不限于授权使用未来世界或者其他应用信息、注册并开通账号、发布信息、游戏、购买产品或者服务等等行为，均为用户自身行为，“未来世界”不对用户的该类行为承担任何责任。
  
  八、知识产权政策
  
  “未来世界”移动客户端系根据用户（含公司所开发、发布的其他平台的用户）指令提供作品上载、传播的信息网络存储空间，并基于大数据技术为用户推荐定制化信息的新型软件。公司重视著作权及其他知识产权的保护。为保护相关权利人的合法权利，根据相关法律、法规的规定，公司制定如下知识产权政策：
  
  1.您理解并同意，在使用“未来世界”相关服务时发布上传的文字、图片、视频、音频，链接等均由您原创或已获合法授权。您通过“未来世界”上传、发布的任何内容的知识产权归属您或原始著作权人所有。
  
  2.您知悉、理解并同意您通过“未来世界”相关服务发布上传的内容，授权公司及其关联公司可在全球范围内、免费、非独家、可转授权地使用，使用范围包括但不限于在当前或其他网站、应用程序、产品或终端设备等，并授权公司及其关联公司对相应内容可进行修改、复制、改编、翻译、汇编或制作衍生产品。
  
  3.您确认并同意授权公司以公司自己的名义或委托专业第三方对侵犯您上传发布的享有知识产权的内容进行代维权，维权形式包括但不限于：监测侵权行为、发送维权函、提起诉讼或仲裁、调解、和解等，公司有权对维权事宜做出决策并独立实施。
  
  4.任何单位或个人认为“未来世界”或公司及其关联企业的任何服务的内容可能涉嫌侵犯其知识产权或信息网络传播权的，应该及时向公司提出书面材料通知投诉，公司在接到第三方针对用户上载的作品的投诉时，有权立即断开相关链接或删除涉嫌侵权作品，无需通知用户；
  
  5.公司有权采取必要的技术措施，禁止用户上载涉嫌侵权的作品。
  
  6.除另有特别声明外，公司提供本服务时所依托的软件著作权、专利权及其他知识产权均归公司所有。
  
  7.公司在本服务中所使用的“未来世界”等商业标识，其著作权或商标权归公司所有。请您在任何情况下都不要私自使用公司的包括但不限于“未来世界”等在内的任何商标、服务标记、商号、域名、网站名称或其他显著品牌特征等（以下统称为“标识”）。未经公司事先书面同意，您不得将本条款前述标识以单独或结合任何方式展示、使用或申请注册商标、进行域名注册等，也不得实施向他人明示或暗示有权展示、使用、或其他有权处理该些标识的行为。由于您违反本协议使用公司上述商标、标识等给公司或他人造成损失的，由您承担全部法律责任。
  
  8.上述及其他任何本服务包含的内容的知识产权均受到法律保护，未经公司、用户或相关权利人书面许可，任何人不得以任何形式进行使用或创造相关衍生作品。
  
  九、遵守当地法律监管
  
  1.您在使用本服务过程中应当遵守当地相关的法律法规，并尊重当地的道德和风俗习惯。如果您的行为违反了当地法律法规或道德风俗，您应当为此独立承担责任。
  
  2.您应避免因使用本服务而使公司卷入政治和公共事件，否则公司有权暂停或终止对您的服务。
  
  十、违约处理
  
  1.针对您违反本协议或其他服务条款的行为，公司有权独立判断并视情况采取预先警示、拒绝发布、立即停止传输信息、扣除或清零账户收益、删除、短期封号、限制账号部分或者全部功能直至永久关闭账号等措施。公司有权公告处理结果，且有权根据实际情况决定是否恢复使用。对涉嫌违反法律法规、涉嫌违法犯罪的行为将保存有关记录，并依法向有关主管部门报告、配合有关主管部门调查。
  
  2.因您违反本协议或其他服务条款规定，引起第三方投诉或诉讼索赔的，您应当自行承担全部法律责任。因您的违法或违约行为导致公司及其关联公司、控制公司向任何第三方赔偿或遭受国家机关处罚的，您还应足额赔偿公司及其关联公司、控制公司因此遭受的全部损失。
  
  3.因您违反本协议或其他服务条款规定，造成公司向任何第三方承担责任的，公司在承担所述责任后有权向用户足额追偿，由此产生的合理费用包括但不限于，律师费、公证费、鉴定费、差旅费、诉讼费等亦由用户承担。
  
  4.公司尊重并保护法人、公民的知识产权、名誉权、姓名权、隐私权等合法权益。您保证，在使用相关服务时上传的文字、图片、视频、音频、链接等不侵犯任何第三方的知识产权、名誉权、姓名权、隐私权等权利及合法权益。否则，公司有权在收到权利方或者相关方通知的情况下移除该涉嫌侵权内容。针对第三方提出的全部权利主张，您应自行承担全部法律责任；如因您的侵权行为导致公司及其关联公司、控制公司遭受损失的（包括经济、商誉等损失），您还应足额赔偿公司及其关联公司、控制公司遭受的全部损失。
  
  十一、不可抗力及其他免责事由
  
  1.您理解并同意，在使用本服务的过程中，可能会遇到不可抗力等风险因素，使本服务发生中断。不可抗力是指不能预见、不能克服并不能避免且对一方或双方造成重大影响的客观事件，包括但不限于自然灾害如洪水、地震、瘟疫流行和风暴等以及社会事件如战争、动乱、政府行为等。出现上述情况时，公司将努力在第一时间与相关单位配合，及时进行修复，但是由此给您造成的损失公司在法律允许的范围内免责。
  
  2.在法律允许的范围内，公司对以下情形导致的服务中断或受阻不承担责任：
  
  ①受到计算机病毒、木马或其他恶意程序、黑客攻击的破坏；
  
  ②用户或公司的电脑软件、系统、硬件和通信线路出现故障；
  
  ③用户操作不当；
  
  ④用户通过非公司授权的方式使用本服务；
  
  ⑤其他公司无法控制或合理预见的情形。
  
  3.您理解并同意，“未来世界”软件及相关服务可能会受多种因素的影响或干扰，公司不保证(包括但不限于)：
  
  ①公司完全适合用户的使用要求；
  
  ②公司不受干扰，及时、安全、可靠或不出现错误；您经由公司取得的任何软件、服务或其他材料符合用户的期望；
  
  ③软件中任何错误都将能得到更正。
  
  4.您理解并同意，在使用本服务的过程中，可能会遇到网络信息或其他用户行为带来的风险，公司不对任何信息的真实性、适用性、合法性承担责任，也不对因侵权行为给您造成的损害负责。这些风险包括但不限于：
  ①来自他人匿名或冒名的含有威胁、诽谤、令人反感或非法内容的信息；
  ②因使用本协议项下的服务，遭受他人误导、欺骗或其他导致或可能导致的任何心理、生理上的伤害以及经济上的损失；
  ③其他因网络信息或用户行为引起的风险。
  
  5.对于涉嫌借款或其他涉财产的网络信息、账户密码、广告或推广等信息的，请您谨慎对待并自行进行判断，基于前述原因您因此遭受的利润、商业信誉、资料损失或其他有形或无形损失，公司不承担任何直接、间接、附带、特别、衍生性或惩罚性的赔偿责任。
  
  6.您理解并同意，本服务并非为某些特定目的而设计，包括但不限于核设施、军事用途、医疗设施、交通通讯等重要领域。如果因为软件或服务的原因导致上述操作失败而带来的人员伤亡、财产损失和环境破坏等，公司不承担法律责任。
  
  7.公司依据本协议约定获得处理违法违规内容的权利，该权利不构成公司的义务或承诺，公司不能保证及时发现违法行为或进行相应处理。
  
  8.在任何情况下，您不应轻信借款、索要密码或其他涉及财产的网络信息。涉及财产操作的，请一定先核实对方身份，并请经常留意有关防范诈骗犯罪的提示。
  
  十二、服务的变更、中断、终止
  
  1.您理解并同意，公司提供的服务是按照现有技术和条件所能达到的现状提供的。公司会尽最大努力向您提供服务，确保服务的连贯性和安全性。您理解，公司不能随时预见和防范技术以及其他风险，包括但不限于不可抗力、病毒、木马、黑客攻击、系统不稳定、第三方服务瑕疵及其他各种安全问题的侵扰等原因可能导致的服务中断、数据丢失以及其他的损失和风险。
  
  您理解并同意，公司为了服务整体运营的需要，有权在公告通知后修改、中断、中止或终止相关服务，而无须向用户负责或承担任何赔偿责任。您使用本软件即视为您已阅读并同意受本协议的约束。未来世界有权在必要时修改本协议条款。您可以在本软件的最新版本中查阅相关协议条款。本协议条款变更后，如果您继续使用本软件，即视为您已接受修改后的协议。如果您不接受修改后的协议，应当停止使用本软件。
  为了进一步改善用户的体验，未来世界将不时更新服务的内容，服务规则也可能随之更新，更新的内容将于公布之日起生效。若您不同意更新后的内容，您有权停止本服务；双方协商一致的，也可另行变更相关服务和对应条款的内容。若您继续使用本服务，表示您同意更新后的内容。如果更新的内容涉及您的主要权利或责任，我们可能以公告、短信或邮箱进行提示您，您也可以随时查阅在未来世界软件中及相关服务规则的最新版本。
  
  十三、软件的更新
  
  13.1
  为了改善用户体验、完善服务内容，未来世界将不断努力开发新的服务，并为您不时提供软件更新（这些更新可能会采取软件替换、修改、功能强化、版本升级等形式）。
  
  13.2
  为了保证本软件及服务的安全性和功能的一致性，未来世界有权不经向您特别通知而对软件进行更新，或者对软件的部分功能效果进行改变或限制。
  
  13.3
  本软件新版本发布后，旧版本的软件可能无法使用。未来世界不保证旧版本软件继续可用及相应的客户服务，请您随时核对并下载最新版本。
  
  十四、管辖与法律适用
  
  1.本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律（不包括冲突法）。
  
  2.本协议签订地为中华人民共和国陕西省宝鸡市陈仓区。
  
  3.若您和公司之间发生任何纠纷或争议，首先应友好协商解决；协商不成的，您同意将纠纷或争议提交本协议签订地（即中华人民共和国陕西省宝鸡市陈仓区）有管辖权的人民法院管辖。
  
  4.本协议所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的依据。
  
  5.本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方具有约束力。
  
  6.公司针对未来世界所组织各种活动的活动规则，为本协议的重要组成部分，与本协议正文具有同等的法律效力。
  `,
  
  
}